[ChosenSMG_XCOM X2WeaponTemplate]
FriendlyName="Kal-00 Tsunami"
FriendlyNamePlural="Kal-00 Tsunami"
BriefSummary="Although ADVENT's'Death Squad' project was stranded, the product was owned by the Assassin. This top-notch advanced bullpup rifle, which should have been distributed to the skirmisher by nature, has a built-in smart AI that synchronizes with the skirmisher's nervous system. Therefore, by engaging in the user's actions itself, it pursues the enemy by itself beyond the shooting aid."
TacticalText="<Bullet/> The Kal-00 Tsunami is the ultimate bullpup of the chosen class.\n<Bullet/> Shooting through the Kal-00 Tsunami guarantees a hit in any case. "
AbilityDescName="bullpup"

[ChosenVektorRifle_XCOM X2WeaponTemplate]
FriendlyName="Dark Testament"
BriefSummary="At one time, there were rumors among Reapers about the'legendary man with a black gun' who had never saved his prey alive. According to this blueprint, the man was the chosen one, the Hunter, and his black gun also seems to have been disguised as his Dark Claw when living in hiding in human society. Although the reloading has to rely on the slow auto reloader inside the Dark Claw we can't analyze."
TacticalText="<Bullet/> The Dark Testament is the ultimate vektor rifle of the chosen class. \n<Bullet/>Although it is impossible to reload, this weapon has an enormous amount of ammo that makes the meaning of the magazine disappear.\n<Bullet/>The shot through the dark testament induces both Rupture and bleeding at the same time, guaranteeing a great pain for the prey."
AbilityDescName="vektor rifle"

[ChosenSidearm_XCOM X2WeaponTemplate]
FriendlyName="THAT Browning"
BriefSummary="The legendary automatic pistol known to have killed high-Dimension creatures such as gods in the distant past, which Warlock considered to be a disgusting monster in the labyrinth of 1961 and tried to seal it forever. There are only parts of an ordinary Browning pistol exposed to an elenium explosion in the black mind-sensitive alloy gun body, but his paranoid accident and fear psionic really made it a dangerous object."
TacticalText="<Bullet/> THAT Browning is the ultimate Autopistol of the chosen class.\n<Bullet/> Guaranted execute humanoid or psionic enemies that are not immune to mental damage."
AbilityDescName="autopistol"

[WristBlade_Chosen X2PairedWeaponTemplate]
FriendlyName="Kakusi"
BriefSummary="Combining the same subspecies blade as the katana and the crystal circuit of codex particles, this was the CCW that will be awarded to ADVENT's'Death Squad'. The ripjack synchronizes with the skirmisher's nervous system at the moment it is equipped, so even the superman becomes agile at a startled moment, and the deadly psionic neurotoxin applied to the blade guarantees the most painful death to the enemy."
TacticalText="<Bullet/>Kakusi is the ultimate Ripjack of the chosen class. \n<Bullet/> When use Skirmisher grapple and ripjack melee skill use with the grapple  hits such as Justice & Wrath , bending reed is triggered. \n<Bullet/> A melee overwarch through Kakusi must hit and cause a critical hit. \n<Bullet/> Vital enemies damaged by Kakusi are given poison, bleeding, and confusion and stun."
AbilityDescName="ripjack"

[CasterGauntlet_Chosen X2PairedWeaponTemplate]
FriendlyName="Whisper's Colour Gauntlet"
BriefSummary="There is only one way to control the forces associated with the 'whispers' sensed when Warlock dies, but none of them have been reluctant to pay the price. -even ADVENT and the Elder. The only way to control this indescribable power is to use the weapon as a core-a weapon that slaughtered many people, and only the Hunter's Dark Lance and its'artificial intelligence' can satisfy the condition."
TacticalText="<Bullet/>Whisper's Colour Gauntlet is the ultimate Gauntlet of the chosen class. \n<Bullet/> Although Whisper's Color Gauntlet is a primary melee weapon, it is capable of long range attacks in exchange for maneuverability. Melee Overwatch also triggers against enemies from a distance.\n<Bullet/>Whisper's Color Gauntlet The actual damage is weak, but the enemy directly damaged by this weapon goes into a panic state, and the aerodynamic power of the skill is increased-A series that consumes focus, \n<Bullet/> Deal with the powers the Chosen and even the Elder feared through massive maximum Focus levels."
AbilityDescName="gauntlet"

[CarterCrit X2AbilityTemplate]
LocFriendlyName="Shamash's fate"
LocLongDescription="Guaranted execute psionic enemies that are not immune to mental damage."
LocHelpText="Guaranted execute humanoid or psionic enemies that are not immune to mental damage."


[MotalCrit X2AbilityTemplate]
LocFriendlyName="Zudjari's end"
LocLongDescription="Guaranted execute humanoid enemies that are not immune to mental damage."
LocHelpText="Guaranted execute humanoid or psionic enemies that are not immune to mental damage."

[ReloadOnKill X2AbilityTemplate]
LocFriendlyName="Slaughter addiction"
LocLongDescription="Dark Testament is immediately reloaded if you kill an enemy. (and that is the only way to reload)"
LocHelpText="Dark Testament is immediately reloaded if you kill an enemy. (and that is the only way to reload)"


[ChosenSkirmisherPostAbilityMelee X2AbilityTemplate]
LocFriendlyName="Bending Reed"
LocLongDescription="Bending Reed"
LocHelpText="Bending Reed"

[CasterGauntletChosen X2AbilityTemplate]
LocFriendlyName="The Whisper"
LocLongDescription="With the permission of 'That Thing', Users can see the world through the eyes of others (same as Squadsight)."
LocHelpText="With the permission of 'That Thing', the user's maximum focus level is increased by +2."


[CasterGauntletChosen2 X2AbilityTemplate]
LocFriendlyName="The Colour"
LocLongDescription="With the permission of 'That Thing', Not only user's maximum focus level is increased by +2 but also can teleport to higher ground."
LocHelpText="With the permission of 'That Thing', Not only user's maximum focus level is increased by +2 but also can teleport to higher ground."


[Apexpredetor X2AbilityTemplate]
LocFriendlyName="Apex Predetor"
LocLongDescription="Shooting through the Dark Testament detonates explosives held by the target."
LocHelpText="Shooting through the Dark Testament detonates explosives held by the target."


[ChosenReaperWeapon_ProvingGround X2TechTemplate]
DisplayName="Joint Manufacturing: Chosen's Reaper Weapons"
Summary="At one time, there were rumors among Reapers about the'legendary man with a black gun' who had never saved his prey alive. And circumstantial evidence of the person's true identity is constantly coming out of the Hunter's Stronghold. Maybe if we work closely with the children of Volk... can restore the legendary Hunter's weapon. "

[ChosenSkirmisherWeapon_ProvingGround X2TechTemplate]
DisplayName="Joint Manufacturing: Chosen's Skirmisher Weapons"
Summary="Although ADVENT's'Death Squad' project was stranded, the product was owned by the Assassin.  If there is a collaboration between our technicians and the Skirmishers, we will be able to create a new weapon of the Chosen that will unlock the full potential of the early ADVENT Superhuman Special Forces."

[ChosenTemplarWeapon_ProvingGround X2TechTemplate]
DisplayName="Joint Manufacturing: Chosen's Templar Weapons"
Summary="There is only one way to control the forces associated with the 'whispers' sensed when Warlock dies, but none of them have been reluctant to pay the price.  However, with the efforts of our technicians and the Templars, will be able to restore the equipment that can fully unleash the Templar's reverse-causal power beyond deciphering the secret information hidden by the Warlock"